# PANDAS

Fast analysis

has Built in visualization

In [2]:
import numpy as np
import pandas as pd

In [7]:
label=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [8]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data=my_data,index=label)

a    10
b    20
c    30
dtype: int64

In [10]:
arr

array([10, 20, 30])

Unlike Numpy array, here we have Index that are labelled, meaning we can call using the labelled index

In [13]:
pd.Series(my_data,label)

a    10
b    20
c    30
dtype: int64

In [14]:
ser1= pd.Series([1,2,3,4],['usa','germany','india','japan'])
ser1

usa        1
germany    2
india      3
japan      4
dtype: int64

# DATA FRAMESÂ¶

In [15]:
from numpy.random import randn

In [16]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.086392  0.594214 -0.990826  0.784196
B  1.940513  1.585467  3.301833 -0.095371
C  0.266096  0.620933  0.335631 -0.208738
D  1.730186  0.893721 -0.463259 -1.906899
E -1.780593  0.290898  0.870754  0.988878

In [17]:
df['W']

A   -0.086392
B    1.940513
C    0.266096
D    1.730186
E   -1.780593
Name: W, dtype: float64

In [18]:
#alt way of grabbing a col
df.W

A   -0.086392
B    1.940513
C    0.266096
D    1.730186
E   -1.780593
Name: W, dtype: float64

In [19]:
#for grabbing multiple col
df[['W','Z','X']]

          W         Z         X
A -0.086392  0.784196  0.594214
B  1.940513 -0.095371  1.585467
C  0.266096 -0.208738  0.620933
D  1.730186 -1.906899  0.893721
E -1.780593  0.988878  0.290898

In [20]:
#Creating a new col
df['new']=df['W']

In [21]:
df

          W         X         Y         Z       new
A -0.086392  0.594214 -0.990826  0.784196 -0.086392
B  1.940513  1.585467  3.301833 -0.095371  1.940513
C  0.266096  0.620933  0.335631 -0.208738  0.266096
D  1.730186  0.893721 -0.463259 -1.906899  1.730186
E -1.780593  0.290898  0.870754  0.988878 -1.780593

In [22]:
#dropping a col!!
#we will have to axis it through the row, axis by default is 0, but we will have to keep it 1
df.drop('new',axis=1)

          W         X         Y         Z
A -0.086392  0.594214 -0.990826  0.784196
B  1.940513  1.585467  3.301833 -0.095371
C  0.266096  0.620933  0.335631 -0.208738
D  1.730186  0.893721 -0.463259 -1.906899
E -1.780593  0.290898  0.870754  0.988878

In [23]:
df
#but we will still have this col

          W         X         Y         Z       new
A -0.086392  0.594214 -0.990826  0.784196 -0.086392
B  1.940513  1.585467  3.301833 -0.095371  1.940513
C  0.266096  0.620933  0.335631 -0.208738  0.266096
D  1.730186  0.893721 -0.463259 -1.906899  1.730186
E -1.780593  0.290898  0.870754  0.988878 -1.780593

In [24]:
#to remove this permenantly, we use Inplace argument, this is done so that we wont accidently lose a data
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A -0.086392  0.594214 -0.990826  0.784196
B  1.940513  1.585467  3.301833 -0.095371
C  0.266096  0.620933  0.335631 -0.208738
D  1.730186  0.893721 -0.463259 -1.906899
E -1.780593  0.290898  0.870754  0.988878

In [25]:
#for dropping a row!!
df.drop('E',inplace=True)
df

          W         X         Y         Z
A -0.086392  0.594214 -0.990826  0.784196
B  1.940513  1.585467  3.301833 -0.095371
C  0.266096  0.620933  0.335631 -0.208738
D  1.730186  0.893721 -0.463259 -1.906899

In [26]:
df.shape

(4, 4)